src/main/resources/examples/updatePlanRequest.xml

<?xml version='1.0' encoding='windows-1252'?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header/>
  <soap:Body>
    <update_acct_plan_multi_m xmlns="urn:client:api:wsdl:document/literal_wrapped:vers:11.0:aria_complete_m_api">
      <client_no>6000228</client_no>
      <auth_key>R3WSkfamtH9bMUrACMtm7FAtx7u8vYFy</auth_key>
      <acct_no>1988540</acct_no>
      <do_write>true</do_write>
      <assignment_directive>3</assignment_directive>
      <plan_updates>
        <plan_updates_row>
          <existing_client_plan_instance_id>2908039</existing_client_plan_instance_id>
          <plan_directive>3</plan_directive>
          <plan_status_cd>1</plan_status_cd>
          <custom_rates>
            <custom_rates_row>
              <custom_rate_client_service_id>SMUploaded</custom_rate_client_service_id>
              <custom_rate_seq_no>1</custom_rate_seq_no>
              <custom_rate_from_unit>1.0</custom_rate_from_unit>
              <custom_rate_per_unit>15.0</custom_rate_per_unit>
            </custom_rates_row>
          </custom_rates>
          <usage_accumulation_reset_months>99</usage_accumulation_reset_months>
        </plan_updates_row>
        <plan_updates_row>
          <existing_client_plan_instance_id>2908040</existing_client_plan_instance_id>
          <plan_directive>3</plan_directive>
          <plan_status_cd>1</plan_status_cd>
          <custom_rates>
            <custom_rates_row>
              <custom_rate_client_service_id>PgMinimumFee</custom_rate_client_service_id>
              <custom_rate_seq_no>1</custom_rate_seq_no>
              <custom_rate_from_unit>1.0</custom_rate_from_unit>
              <custom_rate_per_unit>340.0</custom_rate_per_unit>
            </custom_rates_row>
            <custom_rates_row>
              <custom_rate_client_service_id>PgUploaded</custom_rate_client_service_id>
              <custom_rate_seq_no>1</custom_rate_seq_no>
              <custom_rate_from_unit>1.0</custom_rate_from_unit>
              <custom_rate_to_unit>10.0</custom_rate_to_unit>
              <custom_rate_per_unit>0.75</custom_rate_per_unit>
            </custom_rates_row>
            <custom_rates_row>
              <custom_rate_client_service_id>PgUploaded</custom_rate_client_service_id>
              <custom_rate_seq_no>2</custom_rate_seq_no>
              <custom_rate_from_unit>11.0</custom_rate_from_unit>
              <custom_rate_to_unit>100.0</custom_rate_to_unit>
              <custom_rate_per_unit>0.52</custom_rate_per_unit>
            </custom_rates_row>
            <custom_rates_row>
              <custom_rate_client_service_id>PgUploaded</custom_rate_client_service_id>
              <custom_rate_seq_no>3</custom_rate_seq_no>
              <custom_rate_from_unit>101.0</custom_rate_from_unit>
              <custom_rate_per_unit>0.48</custom_rate_per_unit>
            </custom_rates_row>
          </custom_rates>
        </plan_updates_row>
        <plan_updates_row>
          <existing_client_plan_instance_id>2908041</existing_client_plan_instance_id>
          <plan_directive>3</plan_directive>
          <plan_status_cd>1</plan_status_cd>
          <custom_rates/>
        </plan_updates_row>
        <plan_updates_row>
          <existing_client_plan_instance_id>2908042</existing_client_plan_instance_id>
          <plan_directive>3</plan_directive>
          <plan_status_cd>1</plan_status_cd>
          <custom_rates/>
        </plan_updates_row>
        <plan_updates_row>
          <existing_client_plan_instance_id>2908043</existing_client_plan_instance_id>
          <plan_directive>3</plan_directive>
          <plan_status_cd>1</plan_status_cd>
          <custom_rates/>
        </plan_updates_row>
        <plan_updates_row>
          <existing_client_plan_instance_id>2908044</existing_client_plan_instance_id>
          <plan_directive>3</plan_directive>
          <plan_status_cd>1</plan_status_cd>
          <custom_rates/>
        </plan_updates_row>
        <plan_updates_row>
          <existing_client_plan_instance_id>2908045</existing_client_plan_instance_id>
          <plan_directive>3</plan_directive>
          <plan_status_cd>1</plan_status_cd>
          <custom_rates/>
        </plan_updates_row>
        <plan_updates_row>
          <existing_client_plan_instance_id>2908046</existing_client_plan_instance_id>
          <plan_directive>3</plan_directive>
          <plan_status_cd>1</plan_status_cd>
          <custom_rates/>
          <usage_accumulation_reset_months>99</usage_accumulation_reset_months>
        </plan_updates_row>
        <plan_updates_row>
          <plan_directive>3</plan_directive>
          <existing_plan_instance_no>2908038</existing_plan_instance_no>
          <plan_status_cd>32</plan_status_cd>
          <po_num>PO</po_num>
          <plan_instance_field_update>
            <plan_instance_field_update_row>
              <plan_instance_field_name>BILL_TO_ADDRESS_IDS</plan_instance_field_name>
              <plan_instance_field_value>85944</plan_instance_field_value>
              <plan_instance_field_directive>2</plan_instance_field_directive>
            </plan_instance_field_update_row>
            <plan_instance_field_update_row>
              <plan_instance_field_name>CONTINUATION_DATE</plan_instance_field_name>
              <plan_instance_field_value>2017-09-05</plan_instance_field_value>
              <plan_instance_field_directive>2</plan_instance_field_directive>
            </plan_instance_field_update_row>
            <plan_instance_field_update_row>
              <plan_instance_field_name>CONTINUATION_RATE</plan_instance_field_name>
              <plan_instance_field_value>0.3</plan_instance_field_value>
              <plan_instance_field_directive>2</plan_instance_field_directive>
            </plan_instance_field_update_row>
            <plan_instance_field_update_row>
              <plan_instance_field_name>CONTINUATION_RATE_SM</plan_instance_field_name>
              <plan_instance_field_value>11.0</plan_instance_field_value>
              <plan_instance_field_directive>2</plan_instance_field_directive>
            </plan_instance_field_update_row>
            <plan_instance_field_update_row>
              <plan_instance_field_name>CONTRACT_CUSTOMER</plan_instance_field_name>
              <plan_instance_field_value>company</plan_instance_field_value>
              <plan_instance_field_directive>2</plan_instance_field_directive>
            </plan_instance_field_update_row>
            <plan_instance_field_update_row>
              <plan_instance_field_name>CONTRACT_CUSTOMER_ADDRESS</plan_instance_field_name>
              <plan_instance_field_value>address</plan_instance_field_value>
              <plan_instance_field_directive>2</plan_instance_field_directive>
            </plan_instance_field_update_row>
            <plan_instance_field_update_row>
              <plan_instance_field_name>CONTRACT_CUSTOMER_CONTACT</plan_instance_field_name>
              <plan_instance_field_value>contact</plan_instance_field_value>
              <plan_instance_field_directive>2</plan_instance_field_directive>
            </plan_instance_field_update_row>
            <plan_instance_field_update_row>
              <plan_instance_field_name>CONTRACT_TERM</plan_instance_field_name>
              <plan_instance_field_value>1.0</plan_instance_field_value>
              <plan_instance_field_directive>2</plan_instance_field_directive>
            </plan_instance_field_update_row>
            <plan_instance_field_update_row>
              <plan_instance_field_name>CURRENT_ENTITLEMENT</plan_instance_field_name>
              <plan_instance_field_value>VDR; SecureExcelViewer</plan_instance_field_value>
              <plan_instance_field_directive>2</plan_instance_field_directive>
            </plan_instance_field_update_row>
            <plan_instance_field_update_row>
              <plan_instance_field_name>EFFECTIVE_DATE</plan_instance_field_name>
              <plan_instance_field_value>2017-09-11</plan_instance_field_value>
              <plan_instance_field_directive>2</plan_instance_field_directive>
            </plan_instance_field_update_row>
            <plan_instance_field_update_row>
              <plan_instance_field_name>HIBERNATION_RATE</plan_instance_field_name>
              <plan_instance_field_value>0.5</plan_instance_field_value>
              <plan_instance_field_directive>2</plan_instance_field_directive>
            </plan_instance_field_update_row>
            <plan_instance_field_update_row>
              <plan_instance_field_name>HIBERNATION_RATE_SM</plan_instance_field_name>
              <plan_instance_field_value>10.0</plan_instance_field_value>
              <plan_instance_field_directive>2</plan_instance_field_directive>
            </plan_instance_field_update_row>
            <plan_instance_field_update_row>
              <plan_instance_field_name>MEDIA_INCLUDED</plan_instance_field_name>
              <plan_instance_field_value>2.0</plan_instance_field_value>
              <plan_instance_field_directive>2</plan_instance_field_directive>
            </plan_instance_field_update_row>
            <plan_instance_field_update_row>
              <plan_instance_field_name>PRIMARY_REP_ID</plan_instance_field_name>
              <plan_instance_field_value>some id</plan_instance_field_value>
              <plan_instance_field_directive>2</plan_instance_field_directive>
            </plan_instance_field_update_row>
            <plan_instance_field_update_row>
              <plan_instance_field_name>PRIMARY_REP_NAME</plan_instance_field_name>
              <plan_instance_field_value>some name</plan_instance_field_value>
              <plan_instance_field_directive>2</plan_instance_field_directive>
            </plan_instance_field_update_row>
            <plan_instance_field_update_row>
              <plan_instance_field_name>PROCESSED_FOR_CONTRACT_MINIMUM</plan_instance_field_name>
              <plan_instance_field_value>0</plan_instance_field_value>
              <plan_instance_field_directive>2</plan_instance_field_directive>
            </plan_instance_field_update_row>
            <plan_instance_field_update_row>
              <plan_instance_field_name>PROJECT_CREATION_DATE</plan_instance_field_name>
              <plan_instance_field_value>2017-09-08</plan_instance_field_value>
              <plan_instance_field_directive>2</plan_instance_field_directive>
            </plan_instance_field_update_row>
            <plan_instance_field_update_row>
              <plan_instance_field_name>PROJECT_PHASE</plan_instance_field_name>
              <plan_instance_field_value>Preparation</plan_instance_field_value>
              <plan_instance_field_directive>2</plan_instance_field_directive>
            </plan_instance_field_update_row>
            <plan_instance_field_update_row>
              <plan_instance_field_name>SALESFORCE_PROJECT_NAME</plan_instance_field_name>
              <plan_instance_field_value>MS Test Sep 8 1</plan_instance_field_value>
              <plan_instance_field_directive>2</plan_instance_field_directive>
            </plan_instance_field_update_row>
            <plan_instance_field_update_row>
              <plan_instance_field_name>SALESREP_SPLIT_AMOUNT</plan_instance_field_name>
              <plan_instance_field_value>Some Split Amount</plan_instance_field_value>
              <plan_instance_field_directive>2</plan_instance_field_directive>
            </plan_instance_field_update_row>
          </plan_instance_field_update>
        </plan_updates_row>
      </plan_updates>
    </update_acct_plan_multi_m>
  </soap:Body>
</soap:Envelope>